## Aryan Maheshwari 
## 201550037
## Rollno - 32
## Section 'M'

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("E:\dataset_folder\missing_values.csv")

In [3]:
df.head()

     area  bedrooms  price
0  1056.0       2.0  39.07
1  2600.0       4.0    120
2  1440.0       3.0     62
3     NaN       3.0    NaN
4  1200.0       NaN     51

In [4]:
df.tail()

      area  bedrooms price
15  1175.0       NaN    42
16  1180.0       3.0   Nan
17     NaN       3.0    60
18  2770.0       3.0   102
19   800.0       1.0    32

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   area      16 non-null     float64
 1   bedrooms  16 non-null     float64
 2   price     17 non-null     object
dtypes: float64(2), object(1)
memory usage: 608.0+ bytes

## Missing value imputation and display the rows with missing data

In [6]:
# showing all the rows with missing values 

df_1 = df[df.isna().any(axis=1)]
df_1

      area  bedrooms price
3      NaN       3.0   NaN
4   1200.0       NaN    51
6   2732.0       4.0   NaN
7      NaN       NaN   155
9   3700.0       NaN   167
12  1000.0       2.0   NaN
13     NaN       2.0    40
15  1175.0       NaN    42
17     NaN       3.0    60

## Count the missing values

In [7]:
print("Total Null-values is :",df.isnull().sum().sum())

Total Null-values is : 11

## Count the Missing values for each columns and display it .

In [8]:
df.isnull().sum()

area        4
bedrooms    4
price       3
dtype: int64

In [9]:
# --------------------------------------------------------done-------------------------------------------------------------